src/test/resources/requests/get_record_by_id_invalid_soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<GetRecordById service="CSW" version="2.0.0"
			xmlns="http://www.opengis.net/cat/csw">
			<ElementSetName>summary</ElementSetName>
		</GetRecordById>
	</soapenv:Body>
</soapenv:Envelope>