trunk/docs/testclient/test_requests/Kst_GetRecById_ID_Summary_Req.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope">
	<SOAP-ENV:Body>
		<csw:GetRecordById xmlns:csw="http://www.opengis.net/cat/csw" service="CSW" version="2.0.0">
    <csw:Id>55E85353-D48F-11D3-BAF0-0060971A0BF7</csw:Id>
    <csw:ElementSetName>summary</csw:ElementSetName>
</csw:GetRecordById>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
