src/test/resources/requests/get_records_1_brief_soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<GetRecords maxRecords="4" outputFormat="text/xml" outputSchema="csw:profile"
			requestId="csw:1" resultType="results" service="CSW" startPosition="1"
			version="2.0.0" xmlns="http://www.opengis.net/cat/csw">
			<Query typeNames="csw:service,csw:dataset">
				<ElementSetName typeNames="">brief</ElementSetName>
				<Constraint version="1.0.0"> 
					<Filter xmlns="http://www.opengis.net/ogc">
						<PropertyIsEqualTo>
							<PropertyName>Title</PropertyName>
							<Literal>Wasser</Literal>
						</PropertyIsEqualTo>
					</Filter>
				</Constraint>
				<SortBy>
					<SortProperty>
						<PropertyName>title</PropertyName>
						<SortOrder>ASC</SortOrder>
					</SortProperty>
				</SortBy>
			</Query>
		</GetRecords>
	</soapenv:Body>
</soapenv:Envelope>